export const categoryKeys = {
  love: "사랑&관계",
  challenge: "성취&도전",
  money: "재물&기회",
  health: "건강&회복",
  horror: "두려움&극복",
  lucky: "행운&긍정적변화",
};

const categories = {
  love: {
    letters: [
      <>
        어떤 관계든 좋고 나쁜 것이 공존한다꿈! 그치만 진심은 쉽게 사라지지
        않는다꿈! 네가 소중히 여기는 관계에 마음을 다하는 게 가장 중요하다꿈!
      </>,
      <>
        오늘은 네 주변을 더 따뜻한 눈으로 바라보자꿈~ 어떤 변화든 네 마음의
        시선에 따라 달라보일 수 있꿈!
      </>,
      <>
        관계는 정원 같은 것이꿈! 정성 들여 가꾸면 예쁜 꽃이 피고, 소중한
        인연으로 이어질 것이꿈! 오늘은 사랑하는 사람들에게 따뜻한 말 한마디를
        건네보는 게 어떻겠냐꿈?
      </>,
    ],
  },
  challenge: {
    letters: [
      <>
        요즘 신경쓰이는 게 있꿈? 이럴 때는 당장 오늘 뭐 먹을지부터 생각하는 게
        좋다꿈! 점심메뉴부터 걱정하라꿈!
      </>,
      <>
        너는 이미 꿈을 향해 한 걸음씩 나아가고 있다꿈! 가끔 길이 헷갈릴 수도
        있지만, 네가 쌓아온 노력은 절대 헛되지 않꿈! 자신을 믿고 계속
        전진하라꿈!
      </>,
      <>
        네가 첫 걸음마를 떼었을 때를 기억하냐꿈? 나는 그때도 너를 응원하고
        있었다꿈! 그때처럼 할 수 있다는 마음을 활짝 열고, 준비하고 있으면 좋을
        것 같꿈!{" "}
      </>,
    ],
  },
  money: {
    letters: [
      <>
        노력하고 있다면 기회는 언제든 찾아올 수 있다꿈! 너무 조급해하지 말고,
        천천히 나아가면 될 거라꿈! 안 되는 건 세상에 없다꿈!
      </>,
      <>
        잃는 것이 있으면 얻는 것도 있는 법이라꿈! 새로운 기회가 다가올 테니 너무
        걱정하지 말자꿈~ 지금처럼 차근차근 나아가면 멋진 일이 펼쳐질 거라꿈!
      </>,
      <>
        돈도 사람과 같아서 쫓으면 도망간다꿈! 여유롭게 준비하고 기다려 보자꿈~
        잘되면 나한테 용돈도 주라꿈! (장난이라꿈!)
      </>,
      <>
        오늘의 작은 노력이 기회를 만드는 거라꿈! 안 되는 건 세상에 없다꿈!
        차곡차곡 노력을 쌓아 네가 꿈꾸는 미래를 만들어가라꿈!
      </>,
      <>
        새로운 기회가 다가올 거라꿈~ 지금처럼 차근차근 나아가면 분명 네가 원하는
        일이 펼쳐질 거라꿈! 잘 되면 나한테 한 턱 쏘라꿈!
      </>,
      <>
        돈도 사람과 같아서 쫓으면 도망간다꿈! 돈을 부르는 비법이 있꿈! 그건 바로
        꾸준함이라꿈~ 오늘도 열심히 달려보자꿈!
      </>,
    ],
  },
  health: {
    letters: [
      <>
        스로를 더 잘 돌보면 좋을 것 같다꿈! 오늘은 조금 쉬어가면서 나를 아껴주면
        어떨까꿈? 우선 물 한잔 마시고 오자꿈!
      </>,
      <>
        밥은 잘 챙겨 먹고 있꿈? 바쁘더라도 몸은 잘 돌봐야 한다꿈! 세상에서
        너보다 더 중요한 것은 없다꿈! 그러니 오늘 점심 메뉴부터 정하라꿈!
      </>,
      <>
        오늘 하루, 네 몸과 마음이 원하는 걸 해주라꿈~ 쉬고 싶으면 쉬어도 좋고,
        힘이 난다면 가볍게 몸을 움직여 보자꿈! 네가 건강해야 더 많은 것을 이룰
        수 있꿈!
      </>,
    ],
    horror: {
      letters: [
        <>
          오늘 너의 꿈을 보니 네 안에 강한 용기가 보인다꿈~ 어떤 상황이든 잘
          헤쳐나갈 것이겠꿈? 넌 저 하늘의 초신성보다도 더 빛나는 존재니까 아무도
          널 막을 수 없꿈!
        </>,
        <>
          두려움은 성장하는 과정에서 꼭 필요한 감정이라꿈! 넌 충분히 잘하고
          있으니 스스로를 믿어보자꿈~ 두려움이라는 장막 뒤에 멋진 일이 너를
          기다리고 있을 거라꿈!
        </>,
        <>
          내가 아는 넌 생각보다 강하다꿈! 네가 넘을 수 없는 벽은 없다꿈! 혹시
          벽이 너무 크다면? 살짝 돌아가도 된다꿈~ 인생은 우회전도 가능하다꿈!
        </>,
      ],
    },
    lucky: {
      letters: [
        <>
          새로운 시작은 늘 설렘과 함께하는 법이라꿈! 변화를 두려워하지 말고 한
          걸음 내디뎌 보자꿈~ 일단 이불부터 개보자꿈!
        </>,
        <>
          좋은 일을 맞이하기 위해선, 네가 그것을 받아들일 준비가 되어야 한다꿈!
          오늘은 어떤 준비를 할지 알려줄 수 있냐꿈? 아, 그전에 세수부터 하고
          오라꿈~
        </>,
        <>
          기분 좋은 변화는 네가 기대하지 않을 때 슬며시 찾아온다꿈! 네가 환하게
          웃는 순간, 행운도 너를 향해 달려올 것이다꿈~ 오늘도 작은 즐거움을
          찾아보자꿈!
        </>,
      ],
    },
  },
};

export default categories;
